hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/mcu/EWARM/HDSC_HC32M120.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>CMP1</name>
            <description>desc CMP</description>
            <baseAddress>0x4000C800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x6</size>
            </addressBlock>
            <registers>
                <register>
                    <name>MDR</name>
                    <description>desc MDR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x83</resetMask>
                    <fields>
                        <field>
                            <name>CENB</name>
                            <description>desc CENB</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CWDE</name>
                            <description>desc CWDE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMON</name>
                            <description>desc CMON</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FIR</name>
                    <description>desc FIR</description>
                    <addressOffset>0x1</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x73</resetMask>
                    <fields>
                        <field>
                            <name>FCKS</name>
                            <description>desc FCKS</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EDGS</name>
                            <description>desc EDGS</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CIEN</name>
                            <description>desc CIEN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OCR</name>
                    <description>desc OCR</description>
                    <addressOffset>0x2</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F</resetMask>
                    <fields>
                        <field>
                            <name>COEN</name>
                            <description>desc COEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COPS</name>
                            <description>desc COPS</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CPOE</name>
                            <description>desc CPOE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TWOE</name>
                            <description>desc TWOE</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TWOL</name>
                            <description>desc TWOL</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VSR</name>
                    <description>desc VSR</description>
                    <addressOffset>0x3</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x77</resetMask>
                    <fields>
                        <field>
                            <name>RVSL</name>
                            <description>desc RVSL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CVSL</name>
                            <description>desc CVSL</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TWR1</name>
                    <description>desc TWR1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CTWS0</name>
                            <description>desc CTWS0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTWS1</name>
                            <description>desc CTWS1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTWS2</name>
                            <description>desc CTWS2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTWS3</name>
                            <description>desc CTWS3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTWS4</name>
                            <description>desc CTWS4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTWS5</name>
                            <description>desc CTWS5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTWS6</name>
                            <description>desc CTWS6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTWS7</name>
                            <description>desc CTWS7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TWR2</name>
                    <description>desc TWR2</description>
                    <addressOffset>0x5</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CTWP0</name>
                            <description>desc CTWP0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTWP1</name>
                            <description>desc CTWP1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTWP2</name>
                            <description>desc CTWP2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTWP3</name>
                            <description>desc CTWP3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTWP4</name>
                            <description>desc CTWP4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTWP5</name>
                            <description>desc CTWP5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTWP6</name>
                            <description>desc CTWP6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTWP7</name>
                            <description>desc CTWP7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
